zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_EMDIO_GLOBAL.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_EMDIO_GLOBAL.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_EMDIO_GLOBAL
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_EMDIO_GLOBAL_H_)  /* Check if memory map has not been already included */
#define S32K566_EMDIO_GLOBAL_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- EMDIO_GLOBAL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMDIO_GLOBAL_Peripheral_Access_Layer EMDIO_GLOBAL Peripheral Access Layer
 * @{
 */

/** EMDIO_GLOBAL - Size of Registers Arrays */
#define EMDIO_GLOBAL_PCE_SL_COUNT                 1u
#define EMDIO_GLOBAL_HTA_LOOP_COUNT               1u
#define EMDIO_GLOBAL_ARRAY_NUM_RC_COUNT           1u
#define EMDIO_GLOBAL_G_BOOT_COUNT                 2u

/** EMDIO_GLOBAL - Register Layout Typedef */
typedef struct EMDIO_GLOBAL_Struct {
  __I  uint32_t SMCAPR;                            /**< Shared memory capability register, offset: 0x0 */
  __I  uint32_t SMDTR;                             /**< Shared memory depletion threshold register, offset: 0x4 */
  __I  uint32_t SMACR;                             /**< Shared memory available count register, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __I  uint32_t SMCLWMR;                           /**< Shared memory count low watermark register, offset: 0x10 */
  __I  uint32_t SMBUCR;                            /**< Shared memory buffer unassigned count register, offset: 0x14 */
  __I  uint32_t SMBUCHWMR;                         /**< Shared memory buffer unassigned count high watermark register, offset: 0x18 */
  __I  uint32_t SMLCR;                             /**< Shared memory loss count register, offset: 0x1C */
  __I  uint32_t HBTCAPR;                           /**< Hash bucket table capability register, offset: 0x20 */
  __I  uint32_t HBTOR0;                            /**< Hash bucket table operational register 0, offset: 0x24 */
  uint8_t RESERVED_1[4];
  __I  uint32_t HBTOR2;                            /**< Hash bucket table operational register 2, offset: 0x2C */
  uint8_t RESERVED_2[16];
  __I  uint32_t SMERBCAPR;                         /**< Shared memory ENETC receive buffer capability register, offset: 0x40 */
  __I  uint32_t SMERBOR0;                          /**< Shared memory ENETC receive buffer operational register 0, offset: 0x44 */
  __I  uint32_t SMERBOR1;                          /**< Shared memory ENETC receive buffer operational 1, offset: 0x48 */
  uint8_t RESERVED_3[180];
  struct EMDIO_GLOBAL_PCE_SL {                     /* offset: 0x100, array step: 0x8 */
    __I  uint32_t PCEOR;                             /**< PCE 0 operational register, array offset: 0x100, array step: 0x8 */
    __I  uint32_t RFEOR;                             /**< Replication Forwarding Engine 0 operational register, array offset: 0x104, array step: 0x8 */
  } PCE_SL[EMDIO_GLOBAL_PCE_SL_COUNT];
  uint8_t RESERVED_4[92];
  __I  uint32_t NETCCLKR;                          /**< NETC clock register, offset: 0x164 */
  uint8_t RESERVED_5[152];
  struct EMDIO_GLOBAL_HTA_LOOP {                   /* offset: 0x200, array step: 0x28 */
    __I  uint32_t HTACAPR;                           /**< HTA 0 capability register, array offset: 0x200, array step: 0x28 */
    __I  uint32_t HTARFCOR;                          /**< HTA 0 receive frame count operational register, array offset: 0x204, array step: 0x28 */
    __I  uint32_t HTAHPBCOR;                         /**< HTA 0 high priority byte count operational register, array offset: 0x208, array step: 0x28 */
    __I  uint32_t HTALPBCOR;                         /**< HTA 0 low priority byte count operational register, array offset: 0x20C, array step: 0x28 */
    uint8_t RESERVED_0[20];
    __I  uint32_t HTATFCOR;                          /**< HTA 0 transmit frame count operational register, array offset: 0x224, array step: 0x28 */
  } HTA_LOOP[EMDIO_GLOBAL_HTA_LOOP_COUNT];
  uint8_t RESERVED_6[216];
  struct EMDIO_GLOBAL_ARRAY_NUM_RC {               /* offset: 0x300, array step: 0x10 */
    __IO uint32_t RCSBRLAR;                          /**< Root complex 0 system bus read latency average register, array offset: 0x300, array step: 0x10 */
    __I  uint32_t RCSBRLHWMR;                        /**< Root complex 0 system bus read latency high watermark register, array offset: 0x304, array step: 0x10 */
    __IO uint32_t RCSBWLAR;                          /**< Root complex 0 system bus write latency average register, array offset: 0x308, array step: 0x10 */
    __I  uint32_t RCSBWLHWMR;                        /**< Root complex 0 system bus write latency high watermark register, array offset: 0x30C, array step: 0x10 */
  } ARRAY_NUM_RC[EMDIO_GLOBAL_ARRAY_NUM_RC_COUNT];
  uint8_t RESERVED_7[2280];
  __I  uint32_t IPBRR0;                            /**< IP block revision register 0, offset: 0xBF8 */
  __I  uint32_t IPBRR1;                            /**< IP block revision register 1, offset: 0xBFC */
  uint8_t RESERVED_8[256];
  __I  uint32_t FBLPR[EMDIO_GLOBAL_G_BOOT_COUNT];  /**< Function boot loader parameter register 0..Function boot loader parameter register 1, array offset: 0xD00, array step: 0x4 */
  uint8_t RESERVED_9[280];
  union {                                          /* offset: 0xE20 */
    struct EMDIO_GLOBAL_ERROR_EMDIO {                /* offset: 0xE20 */
      __IO uint32_t EMDIOUFSBECR;                      /**< EMDIO uncorrectable fatal system bus error configuration register, offset: 0xE20 */
      __IO uint32_t EMDIOUFSBESR;                      /**< EMDIO uncorrectable fatal system bus error status register, offset: 0xE24 */
      uint8_t RESERVED_0[40];
      __IO uint32_t EMDIOUNIECR;                       /**< EMDIO uncorrectable non-fatal integrity error configuration register, offset: 0xE50 */
      __IO uint32_t EMDIOUNIESR;                       /**< EMDIO uncorrectable non-fatal integrity error status register, offset: 0xE54 */
      uint8_t RESERVED_1[4];
      __I  uint32_t EMDIOUNIECTR;                      /**< EMDIO uncorrectable non-fatal integrity error count register, offset: 0xE5C */
      __IO uint32_t EMDIOUFIECR;                       /**< EMDIO uncorrectable fatal integrity error configuration register, offset: 0xE60 */
      __IO uint32_t EMDIOUFIESR;                       /**< EMDIO uncorrectable fatal integrity error status register, offset: 0xE64 */
    } EMDIO;
  } ERROR;
} EMDIO_GLOBAL_Type, *EMDIO_GLOBAL_MemMapPtr;

/** Number of instances of the EMDIO_GLOBAL module. */
#define EMDIO_GLOBAL_INSTANCE_COUNT              (1u)

/* EMDIO_GLOBAL - Peripheral instance base addresses */
/** Peripheral NETC__EMDIO_GLOBAL base address */
#define IP_NETC__EMDIO_GLOBAL_BASE               (0x6D110000u)
/** Peripheral NETC__EMDIO_GLOBAL base pointer */
#define IP_NETC__EMDIO_GLOBAL                    ((EMDIO_GLOBAL_Type *)IP_NETC__EMDIO_GLOBAL_BASE)
/** Array initializer of EMDIO_GLOBAL peripheral base addresses */
#define IP_EMDIO_GLOBAL_BASE_ADDRS               { IP_NETC__EMDIO_GLOBAL_BASE }
/** Array initializer of EMDIO_GLOBAL peripheral base pointers */
#define IP_EMDIO_GLOBAL_BASE_PTRS                { IP_NETC__EMDIO_GLOBAL }

/* ----------------------------------------------------------------------------
   -- EMDIO_GLOBAL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMDIO_GLOBAL_Register_Masks EMDIO_GLOBAL Register Masks
 * @{
 */

/*! @name SMCAPR - Shared memory capability register */
/*! @{ */

#define EMDIO_GLOBAL_SMCAPR_NUM_WORDS_MASK       (0xFFFFFFU)
#define EMDIO_GLOBAL_SMCAPR_NUM_WORDS_SHIFT      (0U)
#define EMDIO_GLOBAL_SMCAPR_NUM_WORDS_WIDTH      (24U)
#define EMDIO_GLOBAL_SMCAPR_NUM_WORDS(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_SMCAPR_NUM_WORDS_SHIFT)) & EMDIO_GLOBAL_SMCAPR_NUM_WORDS_MASK)
/*! @} */

/*! @name SMDTR - Shared memory depletion threshold register */
/*! @{ */

#define EMDIO_GLOBAL_SMDTR_THRESH_MASK           (0xFFFFFFU)
#define EMDIO_GLOBAL_SMDTR_THRESH_SHIFT          (0U)
#define EMDIO_GLOBAL_SMDTR_THRESH_WIDTH          (24U)
#define EMDIO_GLOBAL_SMDTR_THRESH(x)             (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_SMDTR_THRESH_SHIFT)) & EMDIO_GLOBAL_SMDTR_THRESH_MASK)
/*! @} */

/*! @name SMACR - Shared memory available count register */
/*! @{ */

#define EMDIO_GLOBAL_SMACR_COUNT_MASK            (0xFFFFFFU)
#define EMDIO_GLOBAL_SMACR_COUNT_SHIFT           (0U)
#define EMDIO_GLOBAL_SMACR_COUNT_WIDTH           (24U)
#define EMDIO_GLOBAL_SMACR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_SMACR_COUNT_SHIFT)) & EMDIO_GLOBAL_SMACR_COUNT_MASK)
/*! @} */

/*! @name SMCLWMR - Shared memory count low watermark register */
/*! @{ */

