zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_EMDIO_GLOBAL.h
#define EMDIO_GLOBAL_PCEOR_MAX_FRAMES_MASK       (0x7F0000U)
#define EMDIO_GLOBAL_PCEOR_MAX_FRAMES_SHIFT      (16U)
#define EMDIO_GLOBAL_PCEOR_MAX_FRAMES_WIDTH      (7U)
#define EMDIO_GLOBAL_PCEOR_MAX_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_PCEOR_MAX_FRAMES_SHIFT)) & EMDIO_GLOBAL_PCEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name RFEOR - Replication Forwarding Engine 0 operational register */
/*! @{ */

#define EMDIO_GLOBAL_RFEOR_NUM_FRAMES_MASK       (0x3FU)
#define EMDIO_GLOBAL_RFEOR_NUM_FRAMES_SHIFT      (0U)
#define EMDIO_GLOBAL_RFEOR_NUM_FRAMES_WIDTH      (6U)
#define EMDIO_GLOBAL_RFEOR_NUM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RFEOR_NUM_FRAMES_SHIFT)) & EMDIO_GLOBAL_RFEOR_NUM_FRAMES_MASK)

#define EMDIO_GLOBAL_RFEOR_HWM_FRAMES_MASK       (0x3F00U)
#define EMDIO_GLOBAL_RFEOR_HWM_FRAMES_SHIFT      (8U)
#define EMDIO_GLOBAL_RFEOR_HWM_FRAMES_WIDTH      (6U)
#define EMDIO_GLOBAL_RFEOR_HWM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RFEOR_HWM_FRAMES_SHIFT)) & EMDIO_GLOBAL_RFEOR_HWM_FRAMES_MASK)

#define EMDIO_GLOBAL_RFEOR_MAX_FRAMES_MASK       (0x3F0000U)
#define EMDIO_GLOBAL_RFEOR_MAX_FRAMES_SHIFT      (16U)
#define EMDIO_GLOBAL_RFEOR_MAX_FRAMES_WIDTH      (6U)
#define EMDIO_GLOBAL_RFEOR_MAX_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RFEOR_MAX_FRAMES_SHIFT)) & EMDIO_GLOBAL_RFEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name NETCCLKR - NETC clock register */
/*! @{ */

#define EMDIO_GLOBAL_NETCCLKR_FREQ_MASK          (0x7FFU)
#define EMDIO_GLOBAL_NETCCLKR_FREQ_SHIFT         (0U)
#define EMDIO_GLOBAL_NETCCLKR_FREQ_WIDTH         (11U)
#define EMDIO_GLOBAL_NETCCLKR_FREQ(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_NETCCLKR_FREQ_SHIFT)) & EMDIO_GLOBAL_NETCCLKR_FREQ_MASK)
/*! @} */

/*! @name HTACAPR - HTA 0 capability register */
/*! @{ */

#define EMDIO_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK  (0xFFU)
#define EMDIO_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT (0U)
#define EMDIO_GLOBAL_HTACAPR_MAX_RX_FRAMES_WIDTH (8U)
#define EMDIO_GLOBAL_HTACAPR_MAX_RX_FRAMES(x)    (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT)) & EMDIO_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK)

#define EMDIO_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK  (0xFF00U)
#define EMDIO_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT (8U)
#define EMDIO_GLOBAL_HTACAPR_MAX_TX_FRAMES_WIDTH (8U)
#define EMDIO_GLOBAL_HTACAPR_MAX_TX_FRAMES(x)    (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT)) & EMDIO_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK)
/*! @} */

/*! @name HTARFCOR - HTA 0 receive frame count operational register */
/*! @{ */

#define EMDIO_GLOBAL_HTARFCOR_HP_COUNT_MASK      (0xFFU)
#define EMDIO_GLOBAL_HTARFCOR_HP_COUNT_SHIFT     (0U)
#define EMDIO_GLOBAL_HTARFCOR_HP_COUNT_WIDTH     (8U)
#define EMDIO_GLOBAL_HTARFCOR_HP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTARFCOR_HP_COUNT_SHIFT)) & EMDIO_GLOBAL_HTARFCOR_HP_COUNT_MASK)

#define EMDIO_GLOBAL_HTARFCOR_HP_HWM_MASK        (0xFF00U)
#define EMDIO_GLOBAL_HTARFCOR_HP_HWM_SHIFT       (8U)
#define EMDIO_GLOBAL_HTARFCOR_HP_HWM_WIDTH       (8U)
#define EMDIO_GLOBAL_HTARFCOR_HP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTARFCOR_HP_HWM_SHIFT)) & EMDIO_GLOBAL_HTARFCOR_HP_HWM_MASK)

#define EMDIO_GLOBAL_HTARFCOR_LP_COUNT_MASK      (0xFF0000U)
#define EMDIO_GLOBAL_HTARFCOR_LP_COUNT_SHIFT     (16U)
#define EMDIO_GLOBAL_HTARFCOR_LP_COUNT_WIDTH     (8U)
#define EMDIO_GLOBAL_HTARFCOR_LP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTARFCOR_LP_COUNT_SHIFT)) & EMDIO_GLOBAL_HTARFCOR_LP_COUNT_MASK)

#define EMDIO_GLOBAL_HTARFCOR_LP_HWM_MASK        (0xFF000000U)
#define EMDIO_GLOBAL_HTARFCOR_LP_HWM_SHIFT       (24U)
#define EMDIO_GLOBAL_HTARFCOR_LP_HWM_WIDTH       (8U)
#define EMDIO_GLOBAL_HTARFCOR_LP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTARFCOR_LP_HWM_SHIFT)) & EMDIO_GLOBAL_HTARFCOR_LP_HWM_MASK)
/*! @} */

/*! @name HTAHPBCOR - HTA 0 high priority byte count operational register */
/*! @{ */

#define EMDIO_GLOBAL_HTAHPBCOR_HP_COUNT_MASK     (0xFFFFU)
#define EMDIO_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT    (0U)
#define EMDIO_GLOBAL_HTAHPBCOR_HP_COUNT_WIDTH    (16U)
#define EMDIO_GLOBAL_HTAHPBCOR_HP_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT)) & EMDIO_GLOBAL_HTAHPBCOR_HP_COUNT_MASK)

#define EMDIO_GLOBAL_HTAHPBCOR_HWM_MASK          (0xFFFF0000U)
#define EMDIO_GLOBAL_HTAHPBCOR_HWM_SHIFT         (16U)
#define EMDIO_GLOBAL_HTAHPBCOR_HWM_WIDTH         (16U)
#define EMDIO_GLOBAL_HTAHPBCOR_HWM(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTAHPBCOR_HWM_SHIFT)) & EMDIO_GLOBAL_HTAHPBCOR_HWM_MASK)
/*! @} */

/*! @name HTALPBCOR - HTA 0 low priority byte count operational register */
/*! @{ */

#define EMDIO_GLOBAL_HTALPBCOR_LP_COUNT_MASK     (0xFFFFU)
#define EMDIO_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT    (0U)
#define EMDIO_GLOBAL_HTALPBCOR_LP_COUNT_WIDTH    (16U)
#define EMDIO_GLOBAL_HTALPBCOR_LP_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT)) & EMDIO_GLOBAL_HTALPBCOR_LP_COUNT_MASK)

#define EMDIO_GLOBAL_HTALPBCOR_HWM_MASK          (0xFFFF0000U)
#define EMDIO_GLOBAL_HTALPBCOR_HWM_SHIFT         (16U)
#define EMDIO_GLOBAL_HTALPBCOR_HWM_WIDTH         (16U)
#define EMDIO_GLOBAL_HTALPBCOR_HWM(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTALPBCOR_HWM_SHIFT)) & EMDIO_GLOBAL_HTALPBCOR_HWM_MASK)
/*! @} */

/*! @name HTATFCOR - HTA 0 transmit frame count operational register */
/*! @{ */

#define EMDIO_GLOBAL_HTATFCOR_HP_COUNT_MASK      (0xFFU)
#define EMDIO_GLOBAL_HTATFCOR_HP_COUNT_SHIFT     (0U)
#define EMDIO_GLOBAL_HTATFCOR_HP_COUNT_WIDTH     (8U)
#define EMDIO_GLOBAL_HTATFCOR_HP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTATFCOR_HP_COUNT_SHIFT)) & EMDIO_GLOBAL_HTATFCOR_HP_COUNT_MASK)

#define EMDIO_GLOBAL_HTATFCOR_HP_HWM_MASK        (0xFF00U)
#define EMDIO_GLOBAL_HTATFCOR_HP_HWM_SHIFT       (8U)
#define EMDIO_GLOBAL_HTATFCOR_HP_HWM_WIDTH       (8U)
#define EMDIO_GLOBAL_HTATFCOR_HP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTATFCOR_HP_HWM_SHIFT)) & EMDIO_GLOBAL_HTATFCOR_HP_HWM_MASK)

#define EMDIO_GLOBAL_HTATFCOR_LP_COUNT_MASK      (0xFF0000U)
#define EMDIO_GLOBAL_HTATFCOR_LP_COUNT_SHIFT     (16U)
#define EMDIO_GLOBAL_HTATFCOR_LP_COUNT_WIDTH     (8U)
#define EMDIO_GLOBAL_HTATFCOR_LP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTATFCOR_LP_COUNT_SHIFT)) & EMDIO_GLOBAL_HTATFCOR_LP_COUNT_MASK)

#define EMDIO_GLOBAL_HTATFCOR_LP_HWM_MASK        (0xFF000000U)
#define EMDIO_GLOBAL_HTATFCOR_LP_HWM_SHIFT       (24U)
#define EMDIO_GLOBAL_HTATFCOR_LP_HWM_WIDTH       (8U)
#define EMDIO_GLOBAL_HTATFCOR_LP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_HTATFCOR_LP_HWM_SHIFT)) & EMDIO_GLOBAL_HTATFCOR_LP_HWM_MASK)
/*! @} */

/*! @name RCSBRLAR - Root complex 0 system bus read latency average register */
/*! @{ */

#define EMDIO_GLOBAL_RCSBRLAR_FRACT_MASK         (0xFFU)
#define EMDIO_GLOBAL_RCSBRLAR_FRACT_SHIFT        (0U)
#define EMDIO_GLOBAL_RCSBRLAR_FRACT_WIDTH        (8U)
#define EMDIO_GLOBAL_RCSBRLAR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBRLAR_FRACT_SHIFT)) & EMDIO_GLOBAL_RCSBRLAR_FRACT_MASK)

#define EMDIO_GLOBAL_RCSBRLAR_INT_MASK           (0xFFF00U)
#define EMDIO_GLOBAL_RCSBRLAR_INT_SHIFT          (8U)
#define EMDIO_GLOBAL_RCSBRLAR_INT_WIDTH          (12U)
#define EMDIO_GLOBAL_RCSBRLAR_INT(x)             (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBRLAR_INT_SHIFT)) & EMDIO_GLOBAL_RCSBRLAR_INT_MASK)
/*! @} */

/*! @name RCSBRLHWMR - Root complex 0 system bus read latency high watermark register */
/*! @{ */

#define EMDIO_GLOBAL_RCSBRLHWMR_FRACT_MASK       (0xFFU)
#define EMDIO_GLOBAL_RCSBRLHWMR_FRACT_SHIFT      (0U)
#define EMDIO_GLOBAL_RCSBRLHWMR_FRACT_WIDTH      (8U)
#define EMDIO_GLOBAL_RCSBRLHWMR_FRACT(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBRLHWMR_FRACT_SHIFT)) & EMDIO_GLOBAL_RCSBRLHWMR_FRACT_MASK)

#define EMDIO_GLOBAL_RCSBRLHWMR_INT_MASK         (0xFFF00U)
#define EMDIO_GLOBAL_RCSBRLHWMR_INT_SHIFT        (8U)
#define EMDIO_GLOBAL_RCSBRLHWMR_INT_WIDTH        (12U)
#define EMDIO_GLOBAL_RCSBRLHWMR_INT(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBRLHWMR_INT_SHIFT)) & EMDIO_GLOBAL_RCSBRLHWMR_INT_MASK)
/*! @} */

/*! @name RCSBWLAR - Root complex 0 system bus write latency average register */
/*! @{ */

#define EMDIO_GLOBAL_RCSBWLAR_FRACT_MASK         (0xFFU)
#define EMDIO_GLOBAL_RCSBWLAR_FRACT_SHIFT        (0U)
#define EMDIO_GLOBAL_RCSBWLAR_FRACT_WIDTH        (8U)
#define EMDIO_GLOBAL_RCSBWLAR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBWLAR_FRACT_SHIFT)) & EMDIO_GLOBAL_RCSBWLAR_FRACT_MASK)

#define EMDIO_GLOBAL_RCSBWLAR_INT_MASK           (0xFFF00U)
#define EMDIO_GLOBAL_RCSBWLAR_INT_SHIFT          (8U)
#define EMDIO_GLOBAL_RCSBWLAR_INT_WIDTH          (12U)
#define EMDIO_GLOBAL_RCSBWLAR_INT(x)             (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBWLAR_INT_SHIFT)) & EMDIO_GLOBAL_RCSBWLAR_INT_MASK)
/*! @} */

/*! @name RCSBWLHWMR - Root complex 0 system bus write latency high watermark register */
/*! @{ */

#define EMDIO_GLOBAL_RCSBWLHWMR_FRACT_MASK       (0xFFU)
#define EMDIO_GLOBAL_RCSBWLHWMR_FRACT_SHIFT      (0U)
#define EMDIO_GLOBAL_RCSBWLHWMR_FRACT_WIDTH      (8U)
#define EMDIO_GLOBAL_RCSBWLHWMR_FRACT(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBWLHWMR_FRACT_SHIFT)) & EMDIO_GLOBAL_RCSBWLHWMR_FRACT_MASK)

#define EMDIO_GLOBAL_RCSBWLHWMR_INT_MASK         (0xFFF00U)
#define EMDIO_GLOBAL_RCSBWLHWMR_INT_SHIFT        (8U)
#define EMDIO_GLOBAL_RCSBWLHWMR_INT_WIDTH        (12U)
#define EMDIO_GLOBAL_RCSBWLHWMR_INT(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_RCSBWLHWMR_INT_SHIFT)) & EMDIO_GLOBAL_RCSBWLHWMR_INT_MASK)
/*! @} */

/*! @name IPBRR0 - IP block revision register 0 */
/*! @{ */

#define EMDIO_GLOBAL_IPBRR0_IP_MN_MASK           (0xFFU)
#define EMDIO_GLOBAL_IPBRR0_IP_MN_SHIFT          (0U)
#define EMDIO_GLOBAL_IPBRR0_IP_MN_WIDTH          (8U)
#define EMDIO_GLOBAL_IPBRR0_IP_MN(x)             (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_IPBRR0_IP_MN_SHIFT)) & EMDIO_GLOBAL_IPBRR0_IP_MN_MASK)

#define EMDIO_GLOBAL_IPBRR0_IP_MJ_MASK           (0xFF00U)
#define EMDIO_GLOBAL_IPBRR0_IP_MJ_SHIFT          (8U)
#define EMDIO_GLOBAL_IPBRR0_IP_MJ_WIDTH          (8U)
#define EMDIO_GLOBAL_IPBRR0_IP_MJ(x)             (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_IPBRR0_IP_MJ_SHIFT)) & EMDIO_GLOBAL_IPBRR0_IP_MJ_MASK)
/*! @} */

/*! @name IPBRR1 - IP block revision register 1 */
/*! @{ */

