zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_EMDIO_GLOBAL.h
#define EMDIO_GLOBAL_IPBRR1_IP_CFG_MASK          (0xFFU)
#define EMDIO_GLOBAL_IPBRR1_IP_CFG_SHIFT         (0U)
#define EMDIO_GLOBAL_IPBRR1_IP_CFG_WIDTH         (8U)
#define EMDIO_GLOBAL_IPBRR1_IP_CFG(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_IPBRR1_IP_CFG_SHIFT)) & EMDIO_GLOBAL_IPBRR1_IP_CFG_MASK)

#define EMDIO_GLOBAL_IPBRR1_IP_MNT_MASK          (0xFF00U)
#define EMDIO_GLOBAL_IPBRR1_IP_MNT_SHIFT         (8U)
#define EMDIO_GLOBAL_IPBRR1_IP_MNT_WIDTH         (8U)
#define EMDIO_GLOBAL_IPBRR1_IP_MNT(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_IPBRR1_IP_MNT_SHIFT)) & EMDIO_GLOBAL_IPBRR1_IP_MNT_MASK)

#define EMDIO_GLOBAL_IPBRR1_IP_INT_MASK          (0xFF0000U)
#define EMDIO_GLOBAL_IPBRR1_IP_INT_SHIFT         (16U)
#define EMDIO_GLOBAL_IPBRR1_IP_INT_WIDTH         (8U)
#define EMDIO_GLOBAL_IPBRR1_IP_INT(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_IPBRR1_IP_INT_SHIFT)) & EMDIO_GLOBAL_IPBRR1_IP_INT_MASK)
/*! @} */

/*! @name FBLPR - Function boot loader parameter register 0..Function boot loader parameter register 1 */
/*! @{ */

#define EMDIO_GLOBAL_FBLPR_PARAM_VAL_MASK        (0xFFFFFFFFU)
#define EMDIO_GLOBAL_FBLPR_PARAM_VAL_SHIFT       (0U)
#define EMDIO_GLOBAL_FBLPR_PARAM_VAL_WIDTH       (32U)
#define EMDIO_GLOBAL_FBLPR_PARAM_VAL(x)          (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_FBLPR_PARAM_VAL_SHIFT)) & EMDIO_GLOBAL_FBLPR_PARAM_VAL_MASK)
/*! @} */

/*! @name EMDIOUFSBECR - EMDIO uncorrectable fatal system bus error configuration register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUFSBECR_RD_MASK        (0x80000000U)
#define EMDIO_GLOBAL_EMDIOUFSBECR_RD_SHIFT       (31U)
#define EMDIO_GLOBAL_EMDIOUFSBECR_RD_WIDTH       (1U)
#define EMDIO_GLOBAL_EMDIOUFSBECR_RD(x)          (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFSBECR_RD_SHIFT)) & EMDIO_GLOBAL_EMDIOUFSBECR_RD_MASK)
/*! @} */

/*! @name EMDIOUFSBESR - EMDIO uncorrectable fatal system bus error status register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUFSBESR_SB_ID_MASK     (0xFU)
#define EMDIO_GLOBAL_EMDIOUFSBESR_SB_ID_SHIFT    (0U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_SB_ID_WIDTH    (4U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_SB_ID(x)       (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFSBESR_SB_ID_SHIFT)) & EMDIO_GLOBAL_EMDIOUFSBESR_SB_ID_MASK)

#define EMDIO_GLOBAL_EMDIOUFSBESR_M_MASK         (0x40000000U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_M_SHIFT        (30U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_M_WIDTH        (1U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_M(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFSBESR_M_SHIFT)) & EMDIO_GLOBAL_EMDIOUFSBESR_M_MASK)

#define EMDIO_GLOBAL_EMDIOUFSBESR_SBE_MASK       (0x80000000U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_SBE_SHIFT      (31U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_SBE_WIDTH      (1U)
#define EMDIO_GLOBAL_EMDIOUFSBESR_SBE(x)         (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFSBESR_SBE_SHIFT)) & EMDIO_GLOBAL_EMDIOUFSBESR_SBE_MASK)
/*! @} */

/*! @name EMDIOUNIECR - EMDIO uncorrectable non-fatal integrity error configuration register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUNIECR_THRESHOLD_MASK  (0xFFU)
#define EMDIO_GLOBAL_EMDIOUNIECR_THRESHOLD_SHIFT (0U)
#define EMDIO_GLOBAL_EMDIOUNIECR_THRESHOLD_WIDTH (8U)
#define EMDIO_GLOBAL_EMDIOUNIECR_THRESHOLD(x)    (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUNIECR_THRESHOLD_SHIFT)) & EMDIO_GLOBAL_EMDIOUNIECR_THRESHOLD_MASK)

#define EMDIO_GLOBAL_EMDIOUNIECR_RD_MASK         (0x80000000U)
#define EMDIO_GLOBAL_EMDIOUNIECR_RD_SHIFT        (31U)
#define EMDIO_GLOBAL_EMDIOUNIECR_RD_WIDTH        (1U)
#define EMDIO_GLOBAL_EMDIOUNIECR_RD(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUNIECR_RD_SHIFT)) & EMDIO_GLOBAL_EMDIOUNIECR_RD_MASK)
/*! @} */

/*! @name EMDIOUNIESR - EMDIO uncorrectable non-fatal integrity error status register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUNIESR_BLOCK_ID_MASK   (0x3E0U)
#define EMDIO_GLOBAL_EMDIOUNIESR_BLOCK_ID_SHIFT  (5U)
#define EMDIO_GLOBAL_EMDIOUNIESR_BLOCK_ID_WIDTH  (5U)
#define EMDIO_GLOBAL_EMDIOUNIESR_BLOCK_ID(x)     (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUNIESR_BLOCK_ID_SHIFT)) & EMDIO_GLOBAL_EMDIOUNIESR_BLOCK_ID_MASK)

#define EMDIO_GLOBAL_EMDIOUNIESR_SM_ID_MASK      (0xFC00U)
#define EMDIO_GLOBAL_EMDIOUNIESR_SM_ID_SHIFT     (10U)
#define EMDIO_GLOBAL_EMDIOUNIESR_SM_ID_WIDTH     (6U)
#define EMDIO_GLOBAL_EMDIOUNIESR_SM_ID(x)        (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUNIESR_SM_ID_SHIFT)) & EMDIO_GLOBAL_EMDIOUNIESR_SM_ID_MASK)

#define EMDIO_GLOBAL_EMDIOUNIESR_INTERR_MASK     (0x80000000U)
#define EMDIO_GLOBAL_EMDIOUNIESR_INTERR_SHIFT    (31U)
#define EMDIO_GLOBAL_EMDIOUNIESR_INTERR_WIDTH    (1U)
#define EMDIO_GLOBAL_EMDIOUNIESR_INTERR(x)       (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUNIESR_INTERR_SHIFT)) & EMDIO_GLOBAL_EMDIOUNIESR_INTERR_MASK)
/*! @} */

/*! @name EMDIOUNIECTR - EMDIO uncorrectable non-fatal integrity error count register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUNIECTR_COUNT_MASK     (0xFFU)
#define EMDIO_GLOBAL_EMDIOUNIECTR_COUNT_SHIFT    (0U)
#define EMDIO_GLOBAL_EMDIOUNIECTR_COUNT_WIDTH    (8U)
#define EMDIO_GLOBAL_EMDIOUNIECTR_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUNIECTR_COUNT_SHIFT)) & EMDIO_GLOBAL_EMDIOUNIECTR_COUNT_MASK)
/*! @} */

/*! @name EMDIOUFIECR - EMDIO uncorrectable fatal integrity error configuration register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUFIECR_RD_MASK         (0x80000000U)
#define EMDIO_GLOBAL_EMDIOUFIECR_RD_SHIFT        (31U)
#define EMDIO_GLOBAL_EMDIOUFIECR_RD_WIDTH        (1U)
#define EMDIO_GLOBAL_EMDIOUFIECR_RD(x)           (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFIECR_RD_SHIFT)) & EMDIO_GLOBAL_EMDIOUFIECR_RD_MASK)
/*! @} */

/*! @name EMDIOUFIESR - EMDIO uncorrectable fatal integrity error status register */
/*! @{ */

#define EMDIO_GLOBAL_EMDIOUFIESR_BLOCK_ID_MASK   (0x3E0U)
#define EMDIO_GLOBAL_EMDIOUFIESR_BLOCK_ID_SHIFT  (5U)
#define EMDIO_GLOBAL_EMDIOUFIESR_BLOCK_ID_WIDTH  (5U)
#define EMDIO_GLOBAL_EMDIOUFIESR_BLOCK_ID(x)     (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFIESR_BLOCK_ID_SHIFT)) & EMDIO_GLOBAL_EMDIOUFIESR_BLOCK_ID_MASK)

#define EMDIO_GLOBAL_EMDIOUFIESR_SM_ID_MASK      (0xFC00U)
#define EMDIO_GLOBAL_EMDIOUFIESR_SM_ID_SHIFT     (10U)
#define EMDIO_GLOBAL_EMDIOUFIESR_SM_ID_WIDTH     (6U)
#define EMDIO_GLOBAL_EMDIOUFIESR_SM_ID(x)        (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFIESR_SM_ID_SHIFT)) & EMDIO_GLOBAL_EMDIOUFIESR_SM_ID_MASK)

#define EMDIO_GLOBAL_EMDIOUFIESR_M_MASK          (0x40000000U)
#define EMDIO_GLOBAL_EMDIOUFIESR_M_SHIFT         (30U)
#define EMDIO_GLOBAL_EMDIOUFIESR_M_WIDTH         (1U)
#define EMDIO_GLOBAL_EMDIOUFIESR_M(x)            (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFIESR_M_SHIFT)) & EMDIO_GLOBAL_EMDIOUFIESR_M_MASK)

#define EMDIO_GLOBAL_EMDIOUFIESR_INTERR_MASK     (0x80000000U)
#define EMDIO_GLOBAL_EMDIOUFIESR_INTERR_SHIFT    (31U)
#define EMDIO_GLOBAL_EMDIOUFIESR_INTERR_WIDTH    (1U)
#define EMDIO_GLOBAL_EMDIOUFIESR_INTERR(x)       (((uint32_t)(((uint32_t)(x)) << EMDIO_GLOBAL_EMDIOUFIESR_INTERR_SHIFT)) & EMDIO_GLOBAL_EMDIOUFIESR_INTERR_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group EMDIO_GLOBAL_Register_Masks */

/*!
 * @}
 */ /* end of group EMDIO_GLOBAL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_EMDIO_GLOBAL_H_) */
